#!/bin/sh

#--------------------------------------------------------------------------------------------------
# Скрипт предназначен для создания файла архива с исходным кодом и публикации его на Nexus.
#--------------------------------------------------------------------------------------------------

VERSION=$(head -n 1 $(dirname "$0")/version.txt)

REPOSITORY=esia-authentication-provider
TAR=$REPOSITORY-sources.tar.gz

#--------------------------------------------------------------------------------------------------
# Удаление файла с архивом исходного кода, если он уже существует
#--------------------------------------------------------------------------------------------------
if [ -f $TAR ]; then rm -rf $TAR; fi
#--------------------------------------------------------------------------------------------------


#--------------------------------------------------------------------------------------------------
# Подготовка файла с архивом исходного кода
#--------------------------------------------------------------------------------------------------
git archive --format=tar.gz HEAD -o $TAR
#--------------------------------------------------------------------------------------------------

#--------------------------------------------------------------------------------------------------
# Публикация файла с архивом исходного кода на Nexus
#--------------------------------------------------------------------------------------------------
mvn deploy:deploy-file                                  \
  -Durl=https://nexus.12.voskhod.ru/repository/releases \
  -DrepositoryId=nexus-releases                         \
  -DgroupId=ru.voskhod.platform.security                \
  -DartifactId=$REPOSITORY-sources                      \
  -Dversion=$VERSION                                    \
  -Dpackaging=tar.gz                                    \
  -Dfile=$TAR
#--------------------------------------------------------------------------------------------------
